app/controllers/articles_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
INSERT INTO "articles" ("created_at", "title", "author", "body", "updated_at") VALUES('2009-11-18 15:04:45', 'This is an Article', 'Alec Benzer', 'O hai. On teh first day, teh ceiling cat...', '2009-11-18 15:04:45')
---
  def create
    @article = Article.new(params[:article])
    @article.category = Category.find(params[:category][:id])

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2009-11-18 22:19:18', "title" = 'Sample Article (1)', "body" = 'This is a sample article. Yo' WHERE "id" = 1
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM "articles" WHERE (articles.id in ('7'))
---
  def search
    @latest_articles = Article.find(:all, :order => 'created_at DESC', :limit => 5)