app/controllers/categories_controller.rb

SELECT * FROM "sections" WHERE ("sections"."id" = 2)
INSERT INTO "categories" ("name", "created_at", "section_id", "updated_at") VALUES('Alec''s second category', '2009-11-18 15:03:53', 2, '2009-11-18 15:03:53')
---
  def create
    @category = Category.new(params[:category])
    @category.section = Section.find(params[:section][:id])

    respond_to do |format|
      if @category.save