app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT * FROM "sections"

  def show
    @section = Section.find(params[:id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)

  def edit
    @section = Section.find(params[:id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)

  def create
    @section = Section.new(params[:section])

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("name", "created_at", "updated_at") VALUES('News', '2009-11-18 22:16:14', '2009-11-18 22:16:14')